#### ElementTransformUtils Members

---

|  |
| --- |
| ElementTransformUtils Class   Methods   See Also |

The  ElementTransformUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CanMirrorElement | Determines whether element can be mirrored. |
| Public method Static member | CanMirrorElements | Determines whether elements can be mirrored. |
| Public method Static member | CopyElement | Copies an element and places the copy at a location indicated by a given transformation. |
| Public method Static member | CopyElements(Document, ICollection ElementId , XYZ) | Copies a set of elements and places the copies at a location indicated by a given translation. |
| Public method Static member | CopyElements(Document, ICollection ElementId , Document, Transform, CopyPasteOptions) | Copies a set of elements from source document to destination document. |
| Public method Static member | CopyElements(View, ICollection ElementId , View, Transform, CopyPasteOptions) | Copies a set of elements from source view to destination view. |
| Public method Static member | GetTransformFromViewToView | Returns a transformation that is applied to elements when copying from one view to another view. |
| Public method Static member | MirrorElement | Creates a mirrored copy of an element about a given plane. |
| Public method Static member | MirrorElements | Mirrors a set of elements about a given plane. |
| Public method Static member | MoveElement | Moves one element by a given transformation. |
| Public method Static member | MoveElements | Moves a set of elements by a given transformation. |
| Public method Static member | RotateElement | Rotates an element about the given axis and angle. |
| Public method Static member | RotateElements | Rotates a set of elements about the given axis and angle. |

# See Also

ElementTransformUtils Class

Autodesk.Revit.DB Namespace